# Using the Pandas Package for Data Analysis, pt.2

This notebook will walk us through a quick tutorial in using the pandas package for data anlysis with python.

### Overview of Tutorial

Over the next 2 class sessions, we will use this tutorial to cover the following processes:

*Day 1*
1. importing the pandas package 
2. creating a dataframe
3. exploring our dataframe's attributes

*Day 2*
4. using functions to filter our data
5. using functions to merge and join our data
6. creating a subset and exporting as a new .csv file

### Acknowledgements

This Pandas tutorial has been adapted from materials provided by the excellent staff at the Davis Library Research Hub.

For more detailed examples and exericses, see thier [Python: Intro to Data lessons](https://unc-libraries-data.github.io/Python/Intro/Introduction_CrashCourse.html)

### Review & Setup

As we did last time, we'll begin by importing the packages that we'll need to use with Python. 

Notice that we load pandas with the usual `import pandas` and an extra `as pd` statement. This allows us to call functions from `pandas` with `pd.<function>` instead of `pandas.<function>` for convenience. `as pd` is **not** necessary to load the package.

Note, we also imported the `numpy` package, which is going to help pandas do some of its math.

In [1]:
import numpy as np
import pandas as pd

We'll also need to create our dataframe object again, by using pandas to read in our .csv file.

`pd.read_csv` reads the tabular data from a Comma Separated Values (csv) file into a dataframe object that we'll define as `df`.

To create our dataframe object we'll define our object `df` by executing the `pd.read_csv()`function on our data file by inserting the relative file path into the parathenses.

In [3]:
df=pd.read_csv("CountyHealthData_2014-2015.csv")

### Filtering our Data

#### Indexing

We'll often want to select certain rows or columns from a large dataframe. As with elements in a list, this can be accomplished using indexing. There are some limitations, however. 

For example, we can use numbers in square brackets to select certain rows, but doing so always returns all the columns in our dataset:

In [5]:
df [0:3]

,State,Region,Division,County,FIPS,GEOID,SMS Region,Year,Premature death,Poor or fair health,...,Drug poisoning deaths,Uninsured adults,Uninsured children,Health care costs,Could not see doctor due to cost,Other primary care providers,Median household income,Children eligible for free lunch,Homicide rate,Inadequate social support
0,AK,West,Pacific,Aleutians West Census Area,2016,2016,Insuff Data,1/1/2014,NaN,0.122,...,NaN,0.374,0.250,3791.0,0.185,216.0,69192,0.127,NaN,0.287
1,AK,West,Pacific,Aleutians West Census Area,2016,2016,Insuff Data,1/1/2015,NaN,0.122,...,NaN,0.314,0.176,4837.0,0.185,254.0,74088,0.133,NaN,NaN
2,AK,West,Pacific,Anchorage Borough,2020,2020,Region 22,1/1/2014,6827.0,0.125,...,15.37,0.218,0.096,6588.0,0.119,135.0,71094,0.319,6.29,0.160

We can also select rows for specific columns using the column names.

In [7]:
df["State"][5:10]

5    AK
6    AK
7    AK
8    AK
9    AK
Name: State, dtype: object

If we want to select multiple columns, we must list them in their own nested set of square brackets.

In [8]:
df[["State", "Year", "County", "Uninsured adults"]][19:25]

   State      Year                      County  Uninsured adults
19    AK  1/1/2015       Kodiak Island Borough             0.320
20    AK  1/1/2014  Lake and Peninsula Borough             0.434
21    AK  1/1/2015  Lake and Peninsula Borough             0.406
22    AK  1/1/2014   Matanuska-Susitna Borough             0.266
23    AK  1/1/2015   Matanuska-Susitna Borough             0.254
24    AK  1/1/2014            Nome Census Area             0.373

Typing all those names out is sometimes tedious or impractical, however. What if we try to select a column by number instead? 

Running the code below produces an error.

In [9]:
df.[1][0:3]

SyntaxError: invalid syntax (<ipython-input-9-b5b6f62e883d>, line 1)

This is where the attributes `.iloc` and `.loc` become useful.

If we use the `.iloc` attribute before our brackets, pandas accepts two numbers separated by a comma. The first number is for rows and the second for columns. 

Below, we select the second row and third column.

In [11]:
df.iloc[2, 3]

'Anchorage Borough'

We can also use a colon to select multiple rows or columns at once. Note the examples below.

In [13]:
df.iloc[:,3] # All rows of column 3

0         Aleutians West Census Area
1         Aleutians West Census Area
2                  Anchorage Borough
3                  Anchorage Borough
4                 Bethel Census Area
5                 Bethel Census Area
6             Dillingham Census Area
7             Dillingham Census Area
8       Fairbanks North Star Borough
9       Fairbanks North Star Borough
10                    Haines Borough
11                    Haines Borough
12                    Juneau Borough
13                    Juneau Borough
14           Kenai Peninsula Borough
15           Kenai Peninsula Borough
16         Ketchikan Gateway Borough
17         Ketchikan Gateway Borough
18             Kodiak Island Borough
19             Kodiak Island Borough
20        Lake and Peninsula Borough
21        Lake and Peninsula Borough
22         Matanuska-Susitna Borough
23         Matanuska-Susitna Borough
24                  Nome Census Area
25                  Nome Census Area
26               North Slope Borough
27               North Slope Borough
28          Northwest Arctic Borough
29          Northwest Arctic Borough
                    ...
6079              Hot Springs County
6080              Hot Springs County
6081                  Johnson County
6082                  Johnson County
6083                  Laramie County
6084                  Laramie County
6085                  Lincoln County
6086                  Lincoln County
6087                  Natrona County
6088                  Natrona County
6089                 Niobrara County
6090                 Niobrara County
6091                     Park County
6092                     Park County
6093                   Platte County
6094                   Platte County
6095                 Sheridan County
6096                 Sheridan County
6097                 Sublette County
6098                 Sublette County
6099               Sweetwater County
6100               Sweetwater County
6101                    Teton County
6102                    Teton County
6103                    Uinta County
6104                    Uinta County
6105                 Washakie County
6106                 Washakie County
6107                   Weston County
6108                   Weston County
Name: County, Length: 6109, dtype: object

In [14]:
df.iloc[0:3,:] # Rows 0-2 of all columns

,State,Region,Division,County,FIPS,GEOID,SMS Region,Year,Premature death,Poor or fair health,...,Drug poisoning deaths,Uninsured adults,Uninsured children,Health care costs,Could not see doctor due to cost,Other primary care providers,Median household income,Children eligible for free lunch,Homicide rate,Inadequate social support
0,AK,West,Pacific,Aleutians West Census Area,2016,2016,Insuff Data,1/1/2014,NaN,0.122,...,NaN,0.374,0.250,3791.0,0.185,216.0,69192,0.127,NaN,0.287
1,AK,West,Pacific,Aleutians West Census Area,2016,2016,Insuff Data,1/1/2015,NaN,0.122,...,NaN,0.314,0.176,4837.0,0.185,254.0,74088,0.133,NaN,NaN
2,AK,West,Pacific,Anchorage Borough,2020,2020,Region 22,1/1/2014,6827.0,0.125,...,15.37,0.218,0.096,6588.0,0.119,135.0,71094,0.319,6.29,0.160

In [15]:
df.iloc[120:126,2:8] # Rows 120-125 of columns 2-8

               Division             County  FIPS  GEOID SMS Region      Year
120  East South Central       Lamar County  1075   1075  Region 16  1/1/2014
121  East South Central       Lamar County  1075   1075  Region 16  1/1/2015
122  East South Central  Lauderdale County  1077   1077  Region 16  1/1/2014
123  East South Central  Lauderdale County  1077   1077  Region 16  1/1/2015
124  East South Central    Lawrence County  1079   1079  Region 16  1/1/2014
125  East South Central    Lawrence County  1079   1079  Region 16  1/1/2015

The i in `iloc` stands for integer. If we still want to use the column names, we can use the `.loc` attribute instead.

In [16]:
df.loc[0:3,"Division"]

0    Pacific
1    Pacific
2    Pacific
3    Pacific
Name: Division, dtype: object

In [17]:
df.loc[0:3,["State","County","Food environment index"]]

  State                      County  Food environment index
0    AK  Aleutians West Census Area                   7.002
1    AK  Aleutians West Census Area                   6.600
2    AK           Anchorage Borough                   8.185
3    AK           Anchorage Borough                   8.000

Indexing in pandas can also be combined with methods. Here, we'll use the `head()` method while indexing with `.loc`.

In [18]:
df.loc[:,["State","County","Health care costs"]].head()

  State                      County  Health care costs
0    AK  Aleutians West Census Area             3791.0
1    AK  Aleutians West Census Area             4837.0
2    AK           Anchorage Borough             6588.0
3    AK           Anchorage Borough             6582.0
4    AK          Bethel Census Area             5860.0

In [19]:
df.loc[:,["State","County","Health care costs"]].sample(n=10)

     State            County  Health care costs
821     GA   Columbia County             8836.0
4701    SD    Roberts County             8544.0
539     CO    Larimer County             8282.0
6061    WV    Wyoming County            10662.0
5920    WI       Sauk County             7030.0
2728    MN  St. Louis County             7851.0
5671    VA   Stafford County             9984.0
3559    NE     Cherry County             9061.0
2207    LA    Cameron Parish             8241.0
1460    IL        Lee County             9485.0

#### Filtering

We've already discussed how to use the "Series" feature of our dataframes to isolate single columns from our tabular dataset, using either dot notation `df.Region` or bracket notation `df["Region"]`.

We can also filter our dataset by using logical conditions (baed on true or false), these can be added using nested square brackets. 

Note the example below.

- The inner statement, `df["State"]=="RI"` looks for a column name and checks if it equals `"RI"`
- The outer statement `df[ ... ]` uses the resulting column of `True/False` values to select rows
- When combined, these two commands call all of the data contained in rows where the value of the `State` field is equal to `"RI"`

In [20]:
df[df["State"] == "RI"]

,State,Region,Division,County,FIPS,GEOID,SMS Region,Year,Premature death,Poor or fair health,...,Drug poisoning deaths,Uninsured adults,Uninsured children,Health care costs,Could not see doctor due to cost,Other primary care providers,Median household income,Children eligible for free lunch,Homicide rate,Inadequate social support
4505,RI,Northeast,New England,Bristol County,44001,44001,Region 12,1/1/2014,4543.0,0.087,...,12.35,0.113,0.027,8579.0,0.077,18.0,64572,0.139,NaN,0.197
4506,RI,Northeast,New England,Bristol County,44001,44001,Region 12,1/1/2015,3891.0,0.087,...,11.67,0.110,0.044,8355.0,0.077,16.0,68415,0.155,NaN,NaN
4507,RI,Northeast,New England,Kent County,44003,44003,Region 12,1/1/2014,6313.0,0.122,...,15.55,0.110,0.027,9890.0,0.105,61.0,59682,0.223,1.44,0.187
4508,RI,Northeast,New England,Kent County,44003,44003,Region 12,1/1/2015,6458.0,0.122,...,18.94,0.114,0.046,9621.0,0.105,68.0,63232,0.230,1.30,NaN
4509,RI,Northeast,New England,Newport County,44005,44005,Region 12,1/1/2014,4457.0,0.109,...,12.29,0.119,0.033,8897.0,0.090,30.0,63434,0.222,NaN,0.176
4510,RI,Northeast,New England,Newport County,44005,44005,Region 12,1/1/2015,4730.0,0.109,...,10.33,0.118,0.048,8149.0,0.090,33.0,67291,0.230,NaN,NaN
4511,RI,Northeast,New England,Providence County,44007,44007,Region 12,1/1/2014,6468.0,0.154,...,15.67,0.190,0.049,9480.0,0.125,88.0,47601,0.484,4.10,0.229
4512,RI,Northeast,New England,Providence County,44007,44007,Region 12,1/1/2015,6124.0,0.154,...,17.51,0.182,0.058,8983.0,0.125,93.0,47642,0.487,3.70,NaN
4513,RI,Northeast,New England,Washington County,44009,44009,Region 12,1/1/2014,4961.0,0.092,...,10.56,0.105,0.031,8776.0,0.088,39.0,69150,0.172,NaN,0.157
4514,RI,Northeast,New England,Washington County,44009,44009,Region 12,1/1/2015,4939.0,0.092,...,13.18,0.107,0.047,8212.0,0.088,49.0,69267,0.177,NaN,NaN

#### `SettingwithCopyWarning` and filtered data

When we use the notation above to filter a DataFrame we may run into a `SettingwithCopyWarning` warning later on in our code if we save this object and then modify it later on. 

That's because this notation creates a reference back to the original dataframe, not a copy of the original dataframe, unless we explicitly use the `.copy()` method. 

If you want to use subset later on, you should create it as follows:

In [21]:
RI_subset = df[df["State"] == "RI"].copy()

In [52]:
RI_subset

,State,Region,Division,County,FIPS,GEOID,SMS Region,Year,Premature death,Poor or fair health,...,Drug poisoning deaths,Uninsured adults,Uninsured children,Health care costs,Could not see doctor due to cost,Other primary care providers,Median household income,Children eligible for free lunch,Homicide rate,Inadequate social support
4505,RI,Northeast,New England,Bristol County,44001,44001,Region 12,1/1/2014,4543.0,0.087,...,12.35,0.113,0.027,8579.0,0.077,18.0,64572,0.139,NaN,0.197
4506,RI,Northeast,New England,Bristol County,44001,44001,Region 12,1/1/2015,3891.0,0.087,...,11.67,0.110,0.044,8355.0,0.077,16.0,68415,0.155,NaN,NaN
4507,RI,Northeast,New England,Kent County,44003,44003,Region 12,1/1/2014,6313.0,0.122,...,15.55,0.110,0.027,9890.0,0.105,61.0,59682,0.223,1.44,0.187
4508,RI,Northeast,New England,Kent County,44003,44003,Region 12,1/1/2015,6458.0,0.122,...,18.94,0.114,0.046,9621.0,0.105,68.0,63232,0.230,1.30,NaN
4509,RI,Northeast,New England,Newport County,44005,44005,Region 12,1/1/2014,4457.0,0.109,...,12.29,0.119,0.033,8897.0,0.090,30.0,63434,0.222,NaN,0.176
4510,RI,Northeast,New England,Newport County,44005,44005,Region 12,1/1/2015,4730.0,0.109,...,10.33,0.118,0.048,8149.0,0.090,33.0,67291,0.230,NaN,NaN
4511,RI,Northeast,New England,Providence County,44007,44007,Region 12,1/1/2014,6468.0,0.154,...,15.67,0.190,0.049,9480.0,0.125,88.0,47601,0.484,4.10,0.229
4512,RI,Northeast,New England,Providence County,44007,44007,Region 12,1/1/2015,6124.0,0.154,...,17.51,0.182,0.058,8983.0,0.125,93.0,47642,0.487,3.70,NaN
4513,RI,Northeast,New England,Washington County,44009,44009,Region 12,1/1/2014,4961.0,0.092,...,10.56,0.105,0.031,8776.0,0.088,39.0,69150,0.172,NaN,0.157
4514,RI,Northeast,New England,Washington County,44009,44009,Region 12,1/1/2015,4939.0,0.092,...,13.18,0.107,0.047,8212.0,0.088,49.0,69267,0.177,NaN,NaN

### Concatenating and Merging our Data

Sometimes its useful to be able to merge and concatenate data. For example, t may be tha case that you've created two subsets from an original data frame as copies, and now wish to recombine them. Or, alternatively you may have found two separate `.csv` files containing similar date and want to merge them together.

In pandas there are 3 primary functions we can use to combine data: concatenate: `pd.concat`, merge:`pd.merge`, and join: `pd.join`.

#### Concatenating Data

Concatenating data is most useful when we have to datasets that are basically identical in shape, and we simply need to 'glue' them together.

Take for example the simple dataframes we've created below. They include two observations each, with two identical series `StudentID` and `GPA_change`, and one series `Semester` that only exists in the second dataframe.

In [24]:
gpa0 = pd.DataFrame({"StudentID" : [1,2],
                   "GPA_change" : np.random.normal(0,1,2)}) #np.random.normal(0,1,2) pulls 2 random values from a Normal(0,1) distribution
gpa0

   StudentID  GPA_change
0          1   -1.343799
1          2   -0.337393

In [25]:
gpa1 = pd.DataFrame({"StudentID" : [3,4],
                   "GPA_change" : np.random.normal(0,1,2),
                   "Semester" : ["Spring", "Fall"]})
gpa1

   StudentID  GPA_change Semester
0          3    0.302898   Spring
1          4    1.871282     Fall

It seems clear that these dataframea would be best combined by stacking them on top of eachother, or appending one to the other as additional rows or observations. 

Panda's `pd.concat` lets us concatenate a list of dataframes into a single dataframe.

In [33]:
pd.concat([gpa0,gpa1],axis=0,ignore_index=True,sort=False)

   StudentID  GPA_change Semester
0          1   -1.343799      NaN
1          2   -0.337393      NaN
2          3    0.302898   Spring
3          4    1.871282     Fall

- `axis=0` indicates that we want to add the dataframes together row-wise. What happens if we change to axis=1?
- Pandas thinks about dimensions as rows and columns, in that order. `axis=0` refers to rows, whereas `axis=1` refers to columns.
- `ignore_index=True`, resets the dataframe index to start at 0 and run to 3. Otherwise our row index would be 0 1 0 1, from the indices of the original two dataframes.
- `sort=False` addresses a behavior for sorting in my version of python that causes an error when non-concatenation axis is not aligned. The value `False` tells it to ignore this sorting behavior

#### Merging Data

When combining two dataframes that share a common set of rows but contain different columsn, we usually can't just concatenate our dataframes together, instead we use certain key variables to make sure the same records end up in the same row.

So again, let's create two new simple datasets below to work from. These data sets will have records in common, but different series.

In [37]:
series0 = pd.DataFrame({"name" : ["Marcos", "Crystal"],
                   "year" : [1993,1996]})
series1 = pd.DataFrame({"name" : ["Crystal", "Marcos"],
                   "proj_num" : [6,3]})

In [38]:
series0

      name  year
0   Marcos  1993
1  Crystal  1996

In [39]:
series1

      name  proj_num
0  Crystal         6
1   Marcos         3

We can see below, that concatenation won't accomplish what we need

In [40]:
pd.concat([series0,series1], axis=1)

      name  year     name  proj_num
0   Marcos  1993  Crystal         6
1  Crystal  1996   Marcos         3

Instead, we can use `pd.merge` to yield smoother results, by merge datasets on key column variables.

In [41]:
pd.merge(series0,series1)

      name  year  proj_num
0   Marcos  1993         3
1  Crystal  1996         6

Note that,`pd.merge`automatically uses all column names that appear in both datasets as keys. 

However, we can also specify key variables:

In [42]:
pd.merge(series0,series1, on = "name")

      name  year  proj_num
0   Marcos  1993         3
1  Crystal  1996         6

Pandas also includes a dataframe method version of `merge`:

In [43]:
series0.merge(series1)

      name  year  proj_num
0   Marcos  1993         3
1  Crystal  1996         6

#### Joining Data and Merging Using `how`

There is also a `join` method that focuses on joining using the Pandas indices for the objects in question. 

It can be useful, but `merge` is usually more versatile.

In [44]:
series0.join(series1.set_index("name"), on="name")

      name  year  proj_num
0   Marcos  1993         3
1  Crystal  1996         6

In the examples above, the two dataframes share the same "name" key values. However, when the values don't completely match, we can use `how` to choose which values get kept and which values get dropped.

To illustrate, first let's create two more new dataframes that have some values that match and some that don't:

In [45]:
uneven0 = pd.DataFrame({"name" : ["Marcos","Crystal","Devin","Lilly"],
                   "year" : [1993,1996,1985,2001]})
uneven1 = pd.DataFrame({"name" : ["Marcos","Crystal","Devin","Tamera"],
                   "project_num" : [6,3,9,8]})

In [46]:
uneven0

      name  year
0   Marcos  1993
1  Crystal  1996
2    Devin  1985
3    Lilly  2001

In [47]:
uneven1

      name  project_num
0   Marcos            6
1  Crystal            3
2    Devin            9
3   Tamera            8

`how` can be used by stipulated 4 differnt target areas: `inner`; `left`; `right`; `outer`

It's useful to think of these as coordinates of a Venn diagram:
- `inner`: keeps only observations in the middle of both circles
- `left`: keeps only observations in the lefthand circle (i.e., the first named dataframe)
- `right`: keeps only observations in the righthand circle (ie., the second named dataframe)
- `outer`: keeps everything, replaces missing data with `NaN`

In [48]:
pd.merge(uneven0,uneven1, how="inner")

      name  year  project_num
0   Marcos  1993            6
1  Crystal  1996            3
2    Devin  1985            9

In [49]:
pd.merge(uneven0,uneven1, how="left")

      name  year  project_num
0   Marcos  1993          6.0
1  Crystal  1996          3.0
2    Devin  1985          9.0
3    Lilly  2001          NaN

In [50]:
pd.merge(uneven0, uneven1, how="right")

      name    year  project_num
0   Marcos  1993.0            6
1  Crystal  1996.0            3
2    Devin  1985.0            9
3   Tamera     NaN            8

In [51]:
pd.merge(uneven0, uneven1, how="outer")

      name    year  project_num
0   Marcos  1993.0          6.0
1  Crystal  1996.0          3.0
2    Devin  1985.0          9.0
3    Lilly  2001.0          NaN
4   Tamera     NaN          8.0

Finally, let's create a new dataframe object with our merged data.

In [53]:
MergedData=pd.merge(uneven0, uneven1, how="outer").copy()

In [54]:
MergedData

      name    year  project_num
0   Marcos  1993.0          6.0
1  Crystal  1996.0          3.0
2    Devin  1985.0          9.0
3    Lilly  2001.0          NaN
4   Tamera     NaN          8.0

### Exporting our New Subsets

Once we've finished manipulating our datasets and creating more **usable** or **useful** subsets for further analysis, we can export them as new .csv files, giving us readymade and openly accessible outputs to share with the public on our GitHub repositories.

#### Exporting to .csv file

To do this we can use the method `.to_csv()` - adding the filename and extension within the parentheses at the end.

So for example, for our filtered subset we would run: `RI_subset.to_csv("RI_subset.csv")` this will export a `.csv` file in our working directory.

By default, this `.csv` will include the row of indices that pandas created when we read the original file into our notebook using `.read_csv`. 

To eliminate these, we can add `index=false` to our statement, which tells it not bring in those index numbers.

`RI_subset.to_csv("RI_subset.csv", index=False)`

In [56]:
RI_subset.to_csv("RI_subset.csv", index=False)

In [57]:
MergedData.to_csv("MergedData.csv", index=False)

### Further Resources

There are lots of other things you can do with pandas! 

For instance, there are ways to change the presentation of your data to facilitate different kinds of analysis and/or viewing using **re-shaping**.

For those of you working with large public datasets that you found on your own, you may want to think about ways of **chunking** your data at the outset, so that you can work to filter,index,etc. a more manageable chunk to begin with.

Check out these other pandas functions and more online in the Davis Library Research Hub's lessons on [Pandas](https://unc-libraries-data.github.io/Python/Jupyter/Pandas.html) and [Pandas: Extra_Topics](https://unc-libraries-data.github.io/Python/Jupyter/Extra_Topics.html).

#### Now open the `.ipyn` files you created last time: 
1. run the cells to import pandas and numpy
2. run the cells to create a dataframe using `pd.read_csv`
3. start manipulating your own data!